huygithcm/code_tung/esp32_car/src/main.cpp
/*
 * FIRMWARE TEST / HIEU CHUAN  -  Xe do line ESP32
 * Test: 2 Motor DC (L298N) + 2 Encoder + Servo tha hang + Buzzer
 *
 * Dieu khien qua Serial Monitor (115200 baud, gui kem Newline).
 * Go lenh roi Enter. Go "?" de xem menu.
 *
 * Chua bat WiFi - chi de test phan cung va lay so lieu hieu chuan
 * (duong kinh banh, PPR encoder, goc servo giu/tha).
 */

// ===================== Che do build =====================
// -DDEBUG_MODE=1 (env:debug/ota) -> day du menu test va chan doan
// -DDEBUG_MODE=0 (env:release)   -> chi giu luong van hanh
#ifndef DEBUG_MODE
#define DEBUG_MODE 1
#endif
#if DEBUG_MODE
  #define DBG(...)   Serial.printf(__VA_ARGS__)
  #define DBGLN(x)   Serial.println(x)
#else
  #define DBG(...)   do{}while(0)
  #define DBGLN(x)   do{}while(0)
#endif

#include <Arduino.h>
#include <ESP32Servo.h>
#include <Preferences.h>
#include <WiFi.h>
#if DEBUG_MODE
#include <WebServer.h>
#endif
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <Wire.h>
#include <WiFiUdp.h>

// ===================== WiFi (STA - noi WiFi nha) =====================
// SUA ten/mat khau WiFi nha ban o day:
#define WIFI_SSID "TEN_WIFI"            // thay bang ten WiFi khi nap lan dau
#define WIFI_PASS "MAT_KHAU_WIFI"       // thay bang mat khau WiFi khi nap lan dau

// Hub (server Node) - IP may chay server + cong WS THUONG cho xe (= PORT+2 = 3002)
// Chi la MAC DINH du phong: xe TU TIM hub qua UDP broadcast (khong can sua tay).
#define HUB_HOST "192.168.1.100"         // IP minh hoa; xe se tu tim hub qua UDP
#define HUB_PORT 3002
#define DISC_PORT 3003             // cong UDP discovery cua server (= PORT+3)

#if DEBUG_MODE
WebServer server(80);
#endif
bool wifiOK = false;
Preferences prefs;

// ===== Cau hinh mang runtime (sua qua Serial, luu NVS). Mac dinh = #define tren =====
String cfgSsid = WIFI_SSID;   // ten WiFi
String cfgPass = WIFI_PASS;   // mat khau WiFi
String cfgHub  = HUB_HOST;    // IP laptop chay server.js

// Forward declaration (dinh nghia o cuoi file, dung trong handleCommand)
void setupWiFi();
void startHub();
void startOTA();
void onWifiUp();
void saveNetConfig();
bool computeLineError();
void hubLog(const String& s);   // in Serial + day log len hub (web doc duoc)

// ===================== CHAN (theo PLAN.md) =====================
// Motor A (banh TRAI)
#define MA_IN1 18
#define MA_IN2 19
#define MA_EN  21
// Motor B (banh PHAI)
#define MB_IN3 22
#define MB_IN4 4
#define MB_EN  16
// Encoder trai (A/B)  -- da hoan doi: 2 encoder bi dao nhau tren xe
#define ENC_L_A 15
#define ENC_L_B 17
// Encoder phai (A/B)  -- dao A/B de sua chieu dem
#define ENC_R_A 14
#define ENC_R_B 13
// Servo tha hang
#define SERVO_PIN 5
// Buzzer
#define BUZZER 23
// MUX 74HC4067 (8 mat do line)
#define MUX_SIG 36
#define MUX_S0  27
#define MUX_S1  26
#define MUX_S2  25
// MUX_S3: chi dung 8 kenh (CH0..CH7) -> S3 luon = 0 -> NOI THANG XUONG GND tren board.
// Nho vay GPIO33 duoc giai phong lam SCL cho MPU6050.
// MPU6050 (I2C) - do gyro Z de hop nhat voi odometry (chinh xac hon khi banh truot)
#define MPU_SDA  32
#define MPU_SCL  33
#define MPU_ADDR 0x68
#define LINE_THRESHOLD 2000   // nguong den/trang (analog 0..4095)
// Mat cam bien con tot (false = bo qua). C1 hong -> mask.
bool SENSOR_OK[8] = { false, true, true, true, true, true, true, true };

// ===================== PWM (LEDC) =====================
#define PWM_FREQ 5000   // 5 kHz cho motor
#define PWM_RES  8      // 8-bit -> duty 0..255
// LEDC: timer = (channel/2) % 4  -> 2 channel lien tiep DUNG CHUNG 1 timer!
// ESP32Servo tu cap phat tu channel 0 (timer 0) va KHONG biet cac ledcSetup() goi truc tiep.
//   servo   = ch0        -> timer 0
//   motor   = ch2, ch3   -> timer 1
//   buzzer  = ch4        -> timer 2  (PHAI khac timer servo!)
// Truoc day buzzer = ch1 -> timer 0 = TRUNG timer servo: moi lan beep, ledcSetup doi
// timer 0 sang tan so beep (8-bit) -> servo mat xung 50Hz -> GIAT/QUAY LOAN.
#define MA_CH    2      // LEDC channel Motor A (ENA)
#define MB_CH    3      // LEDC channel Motor B (ENB)
#define BUZZER_CH 4     // LEDC channel Buzzer (timer 2 - tach khoi servo/motor)

// ===================== Thong so hieu chuan =====================
// Sua sau khi do thuc te. GIA TRI DA HIEU CHUAN (bake tu thong so chay tot tren web).
float WHEEL_DIAMETER_MM = 74.0;   // duong kinh banh HIEU DUNG (mm) - hieu chuan thuc te = 74.0
int   ENCODER_PPR       = 370;    // so xung / vong
float WHEEL_BASE_MM     = 170.0;  // khoang cach tam 2 banh sau (mm)
float CASTER_DIST_MM    = 100.0;  // khoang cach truc banh sau -> banh tu do (mm)

// Goc servo (do)
int SERVO_HOLD = 180;  // goc GIU hang
int SERVO_DROP = 90;   // goc THA hang

// Dao chieu motor neu banh quay nguoc (doi true/false roi flash lai)
bool INVERT_A = true;   // banh TRAI (L)
bool INVERT_B = true;   // banh PHAI (R)

// ===================== Bien toan cuc =====================
Servo servo;
int   motorSpeed = 210;            // toc do hien tai 0..255 (mac dinh 210)
int   MOTOR_MIN_PWM = 120;         // san PWM: lenh khac 0 nhung < nguong -> nang len (motor keu ma khong quay = duoi nguong khoi dong)
volatile long encL = 0;            // dem xung encoder trai
volatile long encR = 0;            // dem xung encoder phai
#if DEBUG_MODE
bool  streamLine = false;          // true = in lien tuc gia tri 8 mat
#endif
int   lineRaw[8];                  // gia tri analog 8 mat (C1..C8)
#if DEBUG_MODE
int   lineMin[8], lineMax[8];      // min/max moi mat khi cali
#endif
int   lineThresh[8];               // nguong rieng moi mat
bool  lineCalibrated = false;      // da cali chua

// --- Bam line PID ---
bool  lineFollow = false;          // dang bam line?
float Kp = 25.0, Ki = 0.0, Kd = 15.0;
float lineError = 0, lastError = 0, errIntegral = 0;
int   baseSpeed = 200;             // toc do co ban khi bam line (tren nguong khoi dong)
bool  lineLost = false;            // mat line?
float LINE_TRIM = 0.5;             // tam that cua mang cam bien (don vi = khoang cach 1 mat).
                                   // C1 mask -> dung C2..C8 -> tam hinh hoc = +0.5.
                                   // Dat lai tu dong: de line dung cho muon bam roi gui {"cmd":"linezero"}

// --- Odometry (toa do tuong doi) ---
float poseX = 0, poseY = 0, poseTheta = 0;   // mm, mm, rad
long  lastOdoL = 0, lastOdoR = 0;

// --- Re theo GOC do bang GYRO (khong phu thuoc pin) ---
// Ban open-loop cu (PWM + THOI GIAN co dinh) bi loi: pin day hon -> cung PWM nhung banh
// quay nhanh hon -> cung thoi gian nhung GOC LON HON -> vot, mat line. Thoi gian khong
// "biet" xe da quay bao nhieu do.
// FIX TRIET DE: quay o PWM co dinh, DOC GOC THAT tu gyro (poseTheta) lien tuc, dung NGAY
// khi dat du goc (tru TURN_LEAD_DEG de bu quan tinh khi cat dien). Do dung theo goc THAT
// nen KHONG phu thuoc dien ap pin. KHONG servo/sua lui -> KHONG lac (quay 1 lan roi thoi).
// Khong co gyro (mpuOK=false) -> fallback ve open-loop thoi gian (ms/do).
int   TURN_OPEN_PWM   = 200;      // PWM khi re (thap hon 1 chut cho bot quan tinh; du thang ma sat)
// LEAD = dung SOM bao nhieu do de bu quan tinh (xe con truot them sau khi cat dien).
// TACH RIENG trai/phai: 2 ben khong doi xung (ma sat/motor) nen vot lo khac nhau - do thuc te
// trai vot ~0.7 do, phai vot ~1.4-2.9 do. Hieu chuan bang script tune-turn.js (re +90/-90).
// Do tu LOG ROUTE THAT (dang tin hon tune quay tai cho): luong truot them sau khi cat dien
// = lead + vot, trung binh ~10.8 do (trai) va ~10.4 do (phai), gan nhu KHONG doi giua goc
// 90 va 180 -> lead hang so la mo hinh dung.
float TURN_LEAD_DEG_L = 10.8;     // ben TRAI  (goc > 0, CCW)
float TURN_LEAD_DEG_R = 10.4;     // ben PHAI  (goc < 0, CW)
int   TURN_TIMEOUT_MS = 4000;     // gioi han an toan: qua thoi gian nay chua dat goc -> dung
// Fallback open-loop (chi dung khi KHONG co gyro): ms = OFFSET + |goc|*PERDEG, rieng trai/phai.
float TURN_MS_OFFSET_L = 65.0, TURN_MS_PER_DEG_L = 4.57;   // ben TRAI (goc > 0, CCW)
float TURN_MS_OFFSET_R = 65.0, TURN_MS_PER_DEG_R = 4.57;   // ben PHAI (goc < 0, CW)
bool  INVERT_TURN = false;        // dao chieu actuation vong re (sua bang serial: TI)

// --- Dieu phoi TUNG BUOC: server gui 1 buoc, xe lam xong bao lai, server gui buoc ke ---
// Khac ban cu (server gui CA chuoi route[], xe tu chay het): gio xe chi giu 1 buoc dang chay
// (curAction), lam xong -> gui {type:stepdone} + dung cho buoc tiep. Server la "bo nao" quyet
// dinh buoc ke dua tren vi tri (odometry) xe bao ve.
WebSocketsClient wsClient;
bool   hubOK = false;             // dang ket noi hub?
String curAction = "";            // buoc dang chay: F/L/R/B/DROP/HOME. "" = idle, dang cho server
float  curDist = 0;               // khoang cach (mm) ky vong cho buoc 'F' hien tai (0 = khong biet)
int    curSeq = -1;               // chi so buoc (server gui), gui kem trong stepdone
float  curNodeX = 0, curNodeY = 0; // toa do NODE xe toi sau buoc nay (server gui) -> RE-ANCHOR
bool   curNodeValid = false;      // co toa do node de snap odometry khong
float  curNodeTh = 0;             // huong doan di vao node (rad) -> snap poseTheta
bool   curNodeThValid = false;    // co huong de snap khong (DROP: khong)
String routeTarget = "";          // ma o dang giao (C1..C9), "" = khong
bool   running = false;           // dang trong 1 chuyen giao?
int    stepPhase = 0;             // 0 = re/khoi dong doan, 1 = tien bam line, 2 = bo canh tam nga tu
float  segStartX = 0, segStartY = 0;  // moc odometry dau doan
bool   leftStart = false;         // da roi giao diem xuat phat cua doan chua
bool   cargo = true;              // con hang tren xe?
int    lineCount = 0;             // so mat thay den o lan doc gan nhat
const float MIN_EDGE = 120;       // mm toi thieu 1 doan truoc khi cho ket thuc
const float MAX_EDGE = 750;       // mm toi da 1 doan (chan runaway neu miss giao diem)
int    INTERSECT_N = 3;           // >= so mat thay den => coi la giao diem (nga tu).
                                  // Do thuc te: giao diem CHU T (nhanh vao o) chi cho cnt=4
                                  // (stub lech 1 ben, khong doi xung nhu giao diem chu thap)
                                  // -> nguong 5 (cu) KHONG BAO GIO nhan ra giao diem chu T,
                                  // xe di thang qua toi khi cham MAX_EDGE moi dung an toan.
int    CENTER_OFFSET_MM = 145;    // sau khi thay nga tu, bo them de canh TRUC BANH vao tam
                                  // = k/c thanh cam bien -> truc banh sau (DA DO: 145mm)
float  centerStartMM = 0;         // moc quang duong khi bat dau bo canh tam
// Sau khi RE xong, cam bien (truoc truc 145mm) thuong CHUA nam tren nhanh moi.
// Thay vi XOAY TAI CHO de do (se quet trung nhanh CU -> chay nguoc), ta BO THANG CHAM
// de dua cam bien len nhanh moi. Khong thay trong REACQUIRE_MAX -> dung an toan.
int    REACQUIRE_SPEED  = 130;    // toc do bo (cham) khi canh tam / tim line
int    REACQUIRE_MAX_MM = 220;    // bo toi da bao nhieu mm de tim; qua -> dung an toan (noi rong de bot MAT LINE o nhanh)
// Sau khi re, KHONG duoc chay thang khi chua thay line moi. Xe chi xoay do cham
// quanh huong vua re; thay line on dinh 3 mau lien tiep moi cho phep tien.
int    REACQUIRE_TURN_PWM = 135;
float  REACQUIRE_SCAN_DEG = 16.0;
int    REACQUIRE_STABLE_N = 3;
unsigned long REACQUIRE_TIMEOUT_MS = 2200;
float  reacqCenterTheta = 0;
int    reacqScanDir = 1;
int    reacqStableCount = 0;
unsigned long reacqStartMs = 0;

