huygithcm/code_tung/esp32_car/src/main.cpp
  if (mpuOK) {
    // --- Dung theo GOC THAT (khong phu thuoc pin) ---
    float targetAbs = fabs(deg) - lead;
    if (targetAbs < fabs(deg) * 0.5f) targetAbs = fabs(deg) * 0.5f;   // goc nho: it nhat quay nua goc
    while (true) {
      updateOdometry();
      float progAbs = fabs(poseTheta - startTheta) * 180.0f / PI;      // goc DA quay (do)
      if (progAbs >= targetAbs) break;
      if (millis() - t0 > (unsigned long)TURN_TIMEOUT_MS) { timedOut = true; break; }
      delay(2);
    }
  } else {
    // --- Fallback: khong co gyro -> chay theo thoi gian (ms/do), rieng trai/phai ---
    float offset = (deg >= 0) ? TURN_MS_OFFSET_L  : TURN_MS_OFFSET_R;
    float perDeg = (deg >= 0) ? TURN_MS_PER_DEG_L : TURN_MS_PER_DEG_R;
    unsigned long ms = (unsigned long)(offset + fabs(deg) * perDeg + 0.5f);
    while (millis() - t0 < ms) { updateOdometry(); delay(2); }
  }
  stopMotors();

  // Cho dung han + do lai goc that de ghi log (xe con truot 1 chut sau khi cat dien)
  delay(120);
  updateOdometry();
  float achievedDeg = (poseTheta - startTheta) * 180.0f / PI;
  char res[170];
  snprintf(res, sizeof(res),
    "[turnres] tgt=%.1f dat=%.2f err=%.2f vot=%.2f lead=%.2f ms=%lu (%s, pwm=%d)",
    deg, achievedDeg, deg - achievedDeg,
    fabs(achievedDeg) - fabs(deg),          // vot lo (>0 = quay QUA goc, <0 = thieu goc)
    lead, millis() - t0,
    mpuOK ? (timedOut ? "gyro-TIMEOUT" : "gyro") : "thoi-gian", TURN_OPEN_PWM);
  hubLog(res);
}

// ===================== Tien ich =====================
// Phat tone tan so freq (Hz) trong ms mili-giay
void buzzerTone(int freq, int ms) {
  ledcSetup(BUZZER_CH, freq, 8);
  ledcAttachPin(BUZZER, BUZZER_CH);
  ledcWrite(BUZZER_CH, 128);   // 50% duty
  delay(ms);
  ledcWrite(BUZZER_CH, 0);
}
void beep(int ms) { buzzerTone(2000, ms); }

// ===================== Cali line =====================
#if DEBUG_MODE
void saveCalibration();   // dinh nghia o duoi (NVS) - forward declare
// Quy trinh: dem nguoc 5s (tick) -> tone bat dau -> quet thanh cam bien
// qua vach den va nen trang trong 5s -> tone ket thuc -> tinh nguong rieng.
void calibrateLine() {
  Serial.println(F("\n== CALI LINE: chuan bi, bat dau sau 5 giay... =="));
  for (int s = 5; s >= 1; s--) {           // dem nguoc, moi giay 1 tick ngan
    Serial.printf("  %d...\n", s);
    buzzerTone(1000, 60);
    delay(940);
  }
  buzzerTone(1800, 400);                    // TONE BAT DAU (cao, dai)
  hubLog(">> QUET thanh cam bien qua VACH va NEN NGAY BAY GIO (5s)!");

  for (int i = 0; i < 8; i++) { lineMin[i] = 4095; lineMax[i] = 0; }
  unsigned long end = millis() + 5000;
  while (millis() < end) {
    readLine();
    for (int i = 0; i < 8; i++) {
      if (lineRaw[i] < lineMin[i]) lineMin[i] = lineRaw[i];
      if (lineRaw[i] > lineMax[i]) lineMax[i] = lineRaw[i];
    }
    delay(4);
  }
  for (int i = 0; i < 8; i++) lineThresh[i] = (lineMin[i] + lineMax[i]) / 2;
  lineCalibrated = true;

  buzzerTone(2600, 150); delay(80); buzzerTone(2600, 250);  // TONE KET THUC (2 beep)
  String rep = "[calib] XONG. thresh:";
  for (int i = 0; i < 8; i++) rep += " C" + String(i + 1) + "=" + String(lineThresh[i]);
  hubLog(rep);
  saveCalibration();   // luu vao NVS de tu nap lan sau
}

// ===================== NVS: luu/nap calibration =====================
void saveCalibration() {
  prefs.begin("line", false);
  prefs.putBytes("thresh", lineThresh, sizeof(lineThresh));
  prefs.putBool("done", true);
  prefs.end();
  Serial.println(F(">> Da luu calibration vao NVS (tu nap lan sau)"));
}
#endif
bool loadCalibration() {
  prefs.begin("line", true);
  bool done = prefs.getBool("done", false);
  if (done) prefs.getBytes("thresh", lineThresh, sizeof(lineThresh));
  prefs.end();
  if (done) {
    lineCalibrated = true;
#if DEBUG_MODE
    Serial.print(F(">> Da nap calibration tu NVS: "));
    for (int i = 0; i < 8; i++) Serial.printf("%d ", lineThresh[i]);
    Serial.println();
#endif
  }
  return done;
}

float pulsesToMM(long pulses) {
  float circ = PI * WHEEL_DIAMETER_MM;       // chu vi
  return (float)pulses / ENCODER_PPR * circ; // quang duong
}

#if DEBUG_MODE
void printMenu() {
  Serial.println(F("\n===== MENU TEST / HIEU CHUAN ====="));
  Serial.println(F("--- MOTOR (2 banh) ---"));
  Serial.println(F("  f = ca 2 banh tien     b = ca 2 banh lui"));
  Serial.println(F("  l = quay trai          r = quay phai"));
  Serial.println(F("  1 = chi banh TRAI tien 2 = chi banh PHAI tien"));
  Serial.println(F("  x = dung               + / - = tang/giam toc"));
  Serial.println(F("  v<so> = dat toc do (vd v200)"));
  Serial.println(F("--- ENCODER ---"));
  Serial.println(F("  e = reset bo dem       p = in xung + quang duong"));
  Serial.println(F("--- SERVO ---"));
  Serial.println(F("  o = THA hang           h = GIU hang"));
  Serial.println(F("  s<goc> = dat goc servo (vd s45)"));
  Serial.println(F("  H<goc> = dat goc GIU   D<goc> = dat goc THA"));
  Serial.println(F("--- DO LINE (MUX) ---"));
  Serial.println(F("  m = in 8 mat lien tuc  M = dung in"));
  Serial.println(F("  n = in 8 mat 1 lan"));
  Serial.println(F("  c = CALI line (5s dem nguoc + tone, roi quet cam bien)"));
  Serial.println(F("--- BAM LINE (PID) + ODOMETRY ---"));
  Serial.println(F("  g = bat dau bam line   x = dung"));
  Serial.println(F("  B<so> = toc do co ban  (vd B130)"));
  Serial.println(F("  kp<so> kd<so> ki<so> = chinh he so PID (vd kp25)"));
  Serial.println(F("  q = in vi tri (x,y,theta)   e = reset odometry"));
  Serial.println(F("--- RE (CO DINH: PWM + thoi gian) ---"));
  Serial.println(F("  T<goc> = re tai cho (vd T90, T-90)"));
  Serial.println(F("  Tm<so> = PWM re co dinh (chung 2 ben)"));
  Serial.println(F("  TsL<so> TsR<so> = ms/do rieng trai/phai   ToL<so> ToR<so> = ms chet rieng"));
  Serial.println(F("  TI = dao chieu actuation vong re"));
  Serial.println(F("--- CAU HINH MANG (WiFi + IP laptop) ---"));
  Serial.println(F("  Wn<ten> = ten WiFi     Wp<mk> = mat khau"));
  Serial.println(F("  Wh<ip>  = IP laptop    Ws = luu + ket noi lai"));
  Serial.println(F("  W       = xem cau hinh hien tai"));
  Serial.println(F("--- KHAC ---"));
  Serial.println(F("  z = buzzer beep        ? = menu nay"));
  Serial.println(F("==================================\n"));
}

