huygithcm/code_tung/esp32_car/src/main.cpp
void handleRoot()   { server.send_P(200, "text/html", PAGE_HTML); }
void handleStart()  { lineFollow = true; lastError = 0; errIntegral = 0;
                      Serial.println("[web] START bam line");
                      server.send(200, "text/plain", "started"); }
void handleStop()   { lineFollow = false; stopMotors();
                      Serial.println("[web] STOP");
                      server.send(200, "text/plain", "stopped"); }
void handleStatus() {
  char buf[160];
  snprintf(buf, sizeof(buf),
    "{\"run\":%d,\"err\":%.2f,\"lost\":%d,\"x\":%.0f,\"y\":%.0f,\"th\":%.0f}",
    lineFollow ? 1 : 0, lineError, lineLost ? 1 : 0,
    poseX, poseY, poseTheta * 180.0f / PI);
  server.send(200, "application/json", buf);
}
#endif

// ===================== DIEU PHOI: route tu hub =====================
// Gui trang thai xe ve hub (khop {status,node,pos,cargo} ma server.js cho).
// Frame odometry TRUNG frame map (HOME=(0,0), nhin +x=0deg) nen gui thang pose.
void sendTelemetry() {
  if (!hubOK) return;
  const char* st = running ? (cargo ? "moving" : "arrived") : "idle";
  char node[16];
  if (routeTarget.length()) snprintf(node, sizeof(node), "\"%s\"", routeTarget.c_str());
  else strcpy(node, "null");
  char buf[176];
  snprintf(buf, sizeof(buf),
    "{\"status\":\"%s\",\"node\":%s,\"pos\":{\"x\":%.0f,\"y\":%.0f,\"th\":%.0f},\"cargo\":%s}",
    st, node, poseX, poseY, poseTheta * 180.0f / PI, cargo ? "true" : "false");
  wsClient.sendTXT(buf);
}

// In log ra Serial VA day len hub duoi dang {type:"clog",text:...} de web hien thi.
void hubLog(const String& s) {
#if DEBUG_MODE
  Serial.println(s);
#endif
  if (!hubOK) return;
  JsonDocument d;
  d["type"] = "clog";
  d["text"] = s;
  String out;
  serializeJson(d, out);
  wsClient.sendTXT(out);
}

// Lai tay F/B/L/R (huy route dang chay). 'S'/khac = dung.
void doManual(const String& dir) {
  running = false; lineFollow = false; routeTarget = "";
  char d = dir.length() ? dir.charAt(0) : 'S';
  int s = motorSpeed;
  // !! PHAN CUNG: chan MA_* thuc te chay banh PHAI, MB_* chay banh TRAI (bi trao khi lap).
  // Da kiem chung: 'F'/'B' khong bi anh huong (2 banh cung chieu);
  // 'L' cu (A=-1,B=+1) lam xe quay PHAI -> phai doi cho L/R.
  // turnRelative va lineFollowStep KHONG sua: chung dung driveA/driveB doi xung nen
  // cai trao nay TU TRIET TIEU (da do: re +90 -> +89.8 do, dung chieu).
  if      (d == 'F') { setMotorA(+1, s); setMotorB(+1, s); }
  else if (d == 'B') { setMotorA(-1, s); setMotorB(-1, s); }
  else if (d == 'L') { setMotorA(+1, s); setMotorB(-1, s); }   // banh phai tien, banh trai lui
  else if (d == 'R') { setMotorA(-1, s); setMotorB(+1, s); }   // banh phai lui, banh trai tien
  else stopMotors();
}

// Tha hang: dung -> ha servo -> beep -> ve goc giu.
void doDrop() {
  stopMotors();
  servo.write(SERVO_DROP);
  cargo = false;
  beep(120);
  delay(400);                 // cho co cau tha xong
  servo.write(SERVO_HOLD);
  hubLog("[drop] Da tha hang");
  sendTelemetry();
}

// Bao 1 buoc da xong (ok/that bai) ve server + dung cho buoc ke.
// HOME (buoc cuoi 1 chuyen) hoac that bai -> ket thuc chuyen (running=false).
void finishStep(bool ok, const String& reason) {
  stopMotors();
  String act = curAction;
  if (act == "HOME" || !ok) { running = false; lineFollow = false; }
  if (act == "HOME") cargo = true;
  if (hubOK) {
    JsonDocument d;
    d["type"] = "stepdone";
    d["seq"] = curSeq;
    d["action"] = act;
    d["ok"] = ok;
    d["reason"] = reason;
    JsonObject p = d["pos"].to<JsonObject>();
    p["x"]  = (int)lroundf(poseX);
    p["y"]  = (int)lroundf(poseY);
    p["th"] = (int)lroundf(poseTheta * 180.0f / PI);
    d["lineCount"] = lineCount;
    String out; serializeJson(d, out);
    wsClient.sendTXT(out);
  }
  // RE-ANCHOR: buoc THANH CONG toi 1 node da biet -> snap odometry ve dung toa do + HUONG node,
  // xoa troi tich luy (xe bam line thuc te dung nhung odometry troi dan). Bao pose THO o tren
  // (server do troi that) roi moi snap. Chi snap khi ok (that bai -> xe khong o node).
  if (ok && curNodeValid) {
    poseX = curNodeX;
    poseY = curNodeY;
    if (curNodeThValid) poseTheta = curNodeTh;   // snap ca HUONG -> xoa troi huong tich luy
  }
  curAction = "";              // idle -> cho server gui buoc ke
  stepPhase = 0;
  sendTelemetry();
}

// Nap 1 buoc tu server va bat dau thuc thi. seq==0 -> chuyen moi (reset odometry tai HOME).
// nodeX/nodeY: toa do node xe se toi (server gui de re-anchor); nodeValid=false -> khong snap.
// nodeTh (rad): huong doan di vao node; nodeThValid=false -> khong snap huong.
void beginStep(const String& action, float dist, int seq, float nodeX, float nodeY, bool nodeValid,
               float nodeTh, bool nodeThValid) {
  if (seq == 0) resetOdometry();     // xe dang o HOME -> xoa troi tich luy
  curAction = action;
  curDist   = dist;
  curSeq    = seq;
  curNodeX = nodeX; curNodeY = nodeY; curNodeValid = nodeValid;
  curNodeTh = nodeTh; curNodeThValid = nodeThValid;
  stepPhase = 0; leftStart = false;
  lastError = 0; errIntegral = 0;
  running = true;
  hubLog("[step] " + String(seq) + ": " + action + (dist > 0 ? (" (" + String((int)dist) + "mm)") : ""));
}

// Thuc thi 1 nhip cua buoc HIEN TAI (goi trong loop khi running && curAction != "").
// Xong 1 buoc -> finishStep(...) (gui stepdone + idle cho buoc ke tu server).
// Moi buoc L/R/B = RE truoc (0/+90/-90/180) roi TIEN 1 canh toi giao diem/het line.
void stepExec() {
  String s = curAction;

  if (s == "DROP") { doDrop(); finishStep(true, "drop"); return; }
  if (s == "HOME") {
    // Nhanh HOME tren map chi noi 1 chieu (tu luoi di ra) -> xe LUON toi HOME voi
    // huong ~180 do (nguoc voi luc xuat phat, nhin +x=0 do). Xoay lai ve 0 do de
    // san sang cho chuyen giao ke tiep. Quay xong PHAI bo TIM LAI line (giong het
    // pha 3 cac buoc re khac) truoc khi ket thuc that su - khong lam vay, sai so
    // quay (~5-8 do) de cam bien dung LECH khoi line that, chuyen giao KE TIEP se
    // "khong thay line" ngay tu buoc dau tien (da xay ra thuc te).
    if (stepPhase == 0) {
      turnRelative(180);
      beginLineReacquire(1);
      stepPhase = 3;
      return;
    }
    // stepPhase == 3: xoay do tai cho va chi ket thuc khi line moi on dinh.
    int reacq = reacquireLineStep();
    if (reacq > 0) { finishStep(true, "home"); return; }
    if (reacq < 0) {
      finishStep(false, "HOME: khong thay line moi sau khi re - da dung an toan");
    }
    return;
  }

  if (stepPhase == 0) {                       // --- Pha 0: re dau doan ---
    float deg = 0;
    if      (s == "L") deg = 90;
    else if (s == "R") deg = -90;
    else if (s == "B") deg = 180;
    if (deg != 0) turnRelative(deg);          // re tai cho (co dinh, blocking)
    segStartX = poseX; segStartY = poseY; leftStart = false;
    lastError = 0; errIntegral = 0;
    if (deg != 0) {
      beginLineReacquire(deg >= 0 ? 1 : -1);
      stepPhase = 3;                           // sau re: xoay do den khi bat chac line moi
    } else {
      stepPhase = 1;                           // F: da dang bam line, khong can pha tim sau re
    }
    return;
  }

  // --- Pha 3: sau khi re, chi XOAY DO; cam chay thang khi chua thay line moi ---
  if (stepPhase == 3) {
    int reacq = reacquireLineStep();
    if (reacq > 0) {                           // da bat on dinh line moi
      // KHONG reset segStart o day: giu moc tu pha 0 (= vi tri NODE, truoc khi bo reacquire)
      // de trav trong pha 1 do dung khoang cach truc banh TU NODE -> khop voi curDist
      // (node->node). Reset o day se bo qua doan reacquire -> trav thieu -> gate sai.
      leftStart = false;
      lastError = 0; errIntegral = 0;
      stepPhase = 1;
      return;
    }
    if (reacq < 0) {
      finishStep(false, "MAT LINE sau khi re: da xoay do nhung khong thay line moi - dung an toan");
      return;
    }
    return;
  }

  // --- Pha 2: bo thang them de canh TRUC BANH vao tam nga tu -> xong buoc ---
  if (stepPhase == 2) {
    float d = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f - centerStartMM;
    if (d < CENTER_OFFSET_MM) { driveA(baseSpeed); driveB(baseSpeed); }   // bo thang
    else { finishStep(true, "toi giao diem"); }                          // da canh tam -> xong buoc
    return;
  }

  // --- Pha 1: tien bam line den giao diem ke ---
  bool found = computeLineError();          // cap nhat lineCount/lineLost/lineError
  float trav = hypotf(poseX - segStartX, poseY - segStartY);
  if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi nga tu cu
  // curDist = khoang cach NODE->NODE (truc banh di het 1 doan). Cam bien o TRUOC truc banh
  // CENTER_OFFSET_MM, nen no cham giao diem ke khi truc banh moi di duoc (curDist - offset).
  // NHAN DIEN NGA TU LA CHINH: chay den khi CAM BIEN THAY vach ngang (cnt>=INTERSECT_N) hoac
  // HET line (den cuoi nhanh) thi dung -> vi tri chuan theo LINE that (line vat ly luon dung),
  // KE CA phai chay qua khoang cach du kien. Khoang cach chi dung 2 viec phu:
  //  - LOWER_MARGIN: khong bat nga tu SOM hon (bo qua giao diem giua doan F-gop / diem xuat phat)
  //  - SAFETY_MARGIN: chan chay lac vo han neu that su mat line (dung khi qua xa moi chiu thua)
  const float LOWER_MARGIN  = 130.0f;   // chi bat nga tu tu (detectTrav - margin) tro di
  const float SAFETY_MARGIN = 220.0f;   // cho phep chay qua detectTrav toi da bay nhieu de tim vach
  bool reached = false;
  if (curDist > 0) {
    float detectTrav = curDist - CENTER_OFFSET_MM;      // trav ky vong khi cam bien cham node
    float minGate = max(40.0f, detectTrav - LOWER_MARGIN);
    if (trav > minGate && leftStart && (lineCount >= INTERSECT_N || lineLost)) reached = true;  // THAY vach -> dung
    else if (trav >= detectTrav + SAFETY_MARGIN) reached = true;   // safety chong chay lac
  } else {
    if (trav > MIN_EDGE && leftStart && (lineCount >= INTERSECT_N || lineLost)) reached = true;
    if (trav > MAX_EDGE) reached = true;
  }
  if (reached) {                       // thay nga tu -> canh tam (khong re ngay = tranh re som)
    centerStartMM = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f;
    stepPhase = 2;
    return;
  }
  if (found) lineDrivePID();           // bam line binh thuong
  else { driveA(REACQUIRE_SPEED); driveB(REACQUIRE_SPEED); }  // hut line giua doan -> bo thang, KHONG xoay
}

// ===================== Hieu chuan quang duong =====================
#if DEBUG_MODE
// Chay thang bam line tu giao diem hien tai -> giao diem ke (biet knownMM, mac dinh 475).
//
// ⚠️ DAT XE: THANH CAM BIEN phai nam NGAY TREN vach ngang cua nga tu xuat phat
//    (KHONG phai truc banh!). Ly do: ta dem quang duong tu luc bat dau (cam bien @ nga tu 1)
//    den luc CAM BIEN thay nga tu 2 -> dung bang 1 canh (475mm). Neu can truc banh vao
//    nga tu thi cam bien da o truoc 145mm -> do ra ~330mm -> goi y duong kinh sai.
void calibDistance(float knownMM) {
  running = false; lineFollow = false;
  resetOdometry();
  leftStart = false;
  hubLog("[caldist] Chay toi nga tu ke (biet " + String(knownMM, 0) +
         "mm). Luu y: dat THANH CAM BIEN tren nga tu xuat phat.");

  unsigned long t0 = millis();
  // Quang duong TIEN = trung binh CO DAU cua 2 banh.
  // (Dung fabs() la SAI: khi mat line xe xoay tai cho -> L am, R duong -> fabs cong don
  //  thanh "da di xa" du xe dung im -> so do rac.)
  auto travel = []() { return (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f; };
  const char* why = "TIMEOUT (khong thay nga tu ke)";   // ly do dung
  while (millis() - t0 < 8000) {                 // timeout 8s
    updateOdometry();
    lineFollowStep();                            // bam line 1 nhip
    float trav = travel();
    if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi giao diem xuat phat
    if (trav > MIN_EDGE) {
      if (leftStart && lineCount >= INTERSECT_N) { why = "thay nga tu ke";       break; }
      if (leftStart && lineLost)                 { why = "MAT LINE (do khong tin)"; break; }
      if (trav > MAX_EDGE)                       { why = "qua MAX_EDGE (do khong tin)"; break; }
    }
    delay(5);
  }
  stopMotors();

  float measured = travel();
  bool  ok = (strcmp(why, "thay nga tu ke") == 0) && measured > MIN_EDGE;
  float suggest = (measured > 1) ? WHEEL_DIAMETER_MM * knownMM / measured : WHEEL_DIAMETER_MM;
  char buf[220];
  snprintf(buf, sizeof(buf),
    "[caldist] %s | biet=%.0fmm do=%.1fmm (encL=%ld encR=%ld) | WHEEL_D hien=%.2f -> goi y=%.2fmm%s",
    why, knownMM, measured, encL, encR, WHEEL_DIAMETER_MM, suggest,
    ok ? "" : "   << KHONG DUNG SO NAY, do lai!");
  hubLog(buf);
}
#endif

// Su kien WebSocket toi hub.
void onWsEvent(WStype_t type, uint8_t* payload, size_t len) {
  switch (type) {
    case WStype_CONNECTED:
      hubOK = true;
      wsClient.sendTXT("{\"role\":\"car\"}");
      DBGLN("[ws] Da ket noi hub, khai bao role=car");
      hubLog("[fw] build " __DATE__ " " __TIME__);   // danh dau ban firmware dang chay (xac minh OTA)
      break;
    case WStype_DISCONNECTED:
      hubOK = false;
      DBGLN("[ws] Mat ket noi hub");
      break;
    case WStype_TEXT: {
      JsonDocument doc;
      if (deserializeJson(doc, payload, len)) return;   // loi parse -> bo
      const char* cmd = doc["cmd"];
      if (!cmd) return;                                 // hello/khac -> bo qua
      if      (!strcmp(cmd, "step"))   beginStep(String((const char*)(doc["action"] | "F")), doc["dist"] | 0.0f, doc["seq"] | 0,
                                                 doc["nodeX"] | 0.0f, doc["nodeY"] | 0.0f, !doc["nodeX"].isNull(),
                                                 ((float)(doc["nodeTh"] | 0.0f)) * PI / 180.0f, !doc["nodeTh"].isNull());
      else if (!strcmp(cmd, "stop"))   { running = false; curAction = ""; lineFollow = false; stopMotors(); routeTarget = ""; hubLog("[ws] STOP"); }
      else if (!strcmp(cmd, "manual")) doManual(String((const char*)(doc["dir"] | "S")));
      else if (!strcmp(cmd, "drop"))   doDrop();
#if DEBUG_MODE
      else if (!strcmp(cmd, "calib"))  { hubLog("[calib] Bat dau hieu chuan line..."); calibrateLine(); }
      else if (!strcmp(cmd, "tune")) {                  // chinh tham so runtime tu web
        if (!doc["base"].isNull())     baseSpeed     = constrain((int)doc["base"], 0, 255);
        if (!doc["min"].isNull())      MOTOR_MIN_PWM = constrain((int)doc["min"], 0, 255);
        if (!doc["kp"].isNull())       Kp = (float)doc["kp"];
        if (!doc["kd"].isNull())       Kd = (float)doc["kd"];
        if (!doc["openpwm"].isNull())    TURN_OPEN_PWM = constrain((int)doc["openpwm"], 0, 255);
        if (!doc["leadL"].isNull())      TURN_LEAD_DEG_L = (float)doc["leadL"];  // do dung som bu quan tinh (trai)
        if (!doc["leadR"].isNull())      TURN_LEAD_DEG_R = (float)doc["leadR"];  // (phai)
        if (!doc["msperdegL"].isNull())  TURN_MS_PER_DEG_L = (float)doc["msperdegL"];
        if (!doc["msperdegR"].isNull())  TURN_MS_PER_DEG_R = (float)doc["msperdegR"];
        if (!doc["msoffsetL"].isNull())  TURN_MS_OFFSET_L = (float)doc["msoffsetL"];
        if (!doc["msoffsetR"].isNull())  TURN_MS_OFFSET_R = (float)doc["msoffsetR"];
        if (!doc["speed"].isNull())    motorSpeed = constrain((int)doc["speed"], 0, 255);
        if (!doc["wheeld"].isNull())   WHEEL_DIAMETER_MM = (float)doc["wheeld"];
        if (!doc["ppr"].isNull())      ENCODER_PPR = (int)doc["ppr"];
        if (!doc["wbase"].isNull())    WHEEL_BASE_MM = (float)doc["wbase"];
        if (!doc["center"].isNull())   CENTER_OFFSET_MM = constrain((int)doc["center"], 0, 300);
        if (!doc["reacqmax"].isNull()) REACQUIRE_MAX_MM = constrain((int)doc["reacqmax"], 20, 500);
        if (!doc["reacqspd"].isNull()) REACQUIRE_SPEED = constrain((int)doc["reacqspd"], 0, 255);
        if (!doc["intersectn"].isNull()) INTERSECT_N = constrain((int)doc["intersectn"], 2, 7);
        if (!doc["trim"].isNull())     LINE_TRIM = (float)doc["trim"];
        if (!doc["gyrow"].isNull())    GYRO_W = constrain((float)doc["gyrow"], 0.0f, 1.0f);
        if (!doc["gyrosign"].isNull()) GYRO_SIGN = ((int)doc["gyrosign"] >= 0) ? 1 : -1;
        hubLog("[tune] base=" + String(baseSpeed) + " min=" + String(MOTOR_MIN_PWM) +
               " kp=" + String(Kp, 1) + " kd=" + String(Kd, 1) +
               " openpwm=" + String(TURN_OPEN_PWM) +
               " leadL=" + String(TURN_LEAD_DEG_L, 2) + " leadR=" + String(TURN_LEAD_DEG_R, 2) +
               " msperdegL=" + String(TURN_MS_PER_DEG_L, 2) + " msperdegR=" + String(TURN_MS_PER_DEG_R, 2) +
               " msoffsetL=" + String(TURN_MS_OFFSET_L, 1) + " msoffsetR=" + String(TURN_MS_OFFSET_R, 1) +
               " speed=" + String(motorSpeed) +
               " wheeld=" + String(WHEEL_DIAMETER_MM, 2) + " ppr=" + String(ENCODER_PPR) +
               " wbase=" + String(WHEEL_BASE_MM, 1) + " center=" + String(CENTER_OFFSET_MM) +
               " intersectn=" + String(INTERSECT_N) +
               " gyro=" + String(mpuOK ? "OK" : "--") + " gyrow=" + String(GYRO_W, 2) +
               " gyrosign=" + String(GYRO_SIGN));
      }
      else if (!strcmp(cmd, "turn")) {                  // test 1 cu re (deg): +trai / -phai
        float deg = doc["deg"] | 90.0;
        hubLog("[turn] test re " + String(deg, 0) + " do...");
        turnRelative(deg);
      }
      else if (!strcmp(cmd, "enc")) {                   // doc encoder (hieu chuan chieu dem)
        if (!doc["reset"].isNull()) resetOdometry();
        hubLog("[enc] L=" + String(encL) + " R=" + String(encR) +
               " x=" + String(poseX, 0) + " y=" + String(poseY, 0) +
               " th=" + String(poseTheta * 180.0f / PI, 1) +
               " | gyro=" + String(mpuOK ? "OK" : "--") +
               (mpuOK ? (" wz=" + String((mpuGyroZraw() - gyroBiasZ) / GYRO_LSB_PER_DPS, 1) + "do/s") : ""));
      }
      else if (!strcmp(cmd, "caldist")) {               // hieu chuan quang duong (1 canh line)
        calibDistance(doc["known"] | 475.0);
      }
      else if (!strcmp(cmd, "gyrocal")) {               // do lai troi tinh gyro (xe phai dung yen)
        stopMotors();
        hubLog("[gyro] Do troi tinh - GIU XE DUNG YEN...");
        gyroCalibrate();
      }
      else if (!strcmp(cmd, "i2cscan"))  i2cScan();      // quet bus I2C (tim MPU6050)
      else if (!strcmp(cmd, "line"))     reportLine();   // doc 8 mat line
      else if (!strcmp(cmd, "linezero")) lineSetZero();  // dat tam line = vi tri hien tai
      else if (!strcmp(cmd, "servo")) {                 // test servo tay tu web (KHONG dong cargo/beep)
        if (!doc["angle"].isNull()) {
          int a = constrain((int)doc["angle"], 0, 180);
          servo.write(a);
          hubLog("[servo] -> " + String(a) + " do (test)");
        } else {
          const char* action = doc["action"] | "";
          if      (!strcmp(action, "drop")) { servo.write(SERVO_DROP); hubLog("[servo] THA (test, goc " + String(SERVO_DROP) + ")"); }
          else if (!strcmp(action, "hold")) { servo.write(SERVO_HOLD); hubLog("[servo] GIU (test, goc " + String(SERVO_HOLD) + ")"); }
        }
      }
#endif
      break;
    }
    default: break;
  }
}

