huygithcm/code_tung/esp32_car/src/main.cpp
// ===================== NVS: luu/nap cau hinh mang =====================
void loadNetConfig() {
  prefs.begin("net", true);
  cfgSsid = prefs.getString("ssid", WIFI_SSID);
  cfgPass = prefs.getString("pass", WIFI_PASS);
  cfgHub  = prefs.getString("hub",  HUB_HOST);
  prefs.end();
  DBG(">> Cau hinh mang: SSID='%s'  HUB=%s\n", cfgSsid.c_str(), cfgHub.c_str());
}
void saveNetConfig() {
  prefs.begin("net", false);
  prefs.putString("ssid", cfgSsid);
  prefs.putString("pass", cfgPass);
  prefs.putString("hub",  cfgHub);
  prefs.end();
  DBGLN(F(">> Da luu cau hinh mang vao NVS (giu sau khi tat nguon)"));
}

void startOTA() {
  if (!wifiOK) return;
  ArduinoOTA.setHostname("esp32-car");
  // ArduinoOTA.setPassword("1234");   // mo neu muon dat mat khau OTA
  ArduinoOTA.onStart([]() { stopMotors(); DBGLN(F("[OTA] Bat dau nap firmware...")); });
  ArduinoOTA.onEnd([]()   { DBGLN(F("\n[OTA] Xong. Khoi dong lai.")); });
  ArduinoOTA.onProgress([](unsigned p, unsigned t) { DBG("[OTA] %u%%\r", p * 100 / t); });
  ArduinoOTA.onError([](ota_error_t e) { DBG("[OTA] Loi %u\n", e); });
  ArduinoOTA.begin();
  DBG(">> OTA san sang: pio run -e ota -t upload  (IP %s)\n", WiFi.localIP().toString().c_str());
}

bool hubStarted = false;          // da goi wsClient.begin() chua

void startHub() {
  if (!wifiOK) return;
  wsClient.begin(cfgHub.c_str(), HUB_PORT, "/");
  wsClient.onEvent(onWsEvent);
  wsClient.setReconnectInterval(3000);
  hubStarted = true;
  DBG(">> Ket noi hub  ws://%s:%d\n", cfgHub.c_str(), HUB_PORT);
}

// ===================== Tu tim hub (UDP broadcast) =====================
// DHCP hay doi IP laptop -> thay vi go tay 'Wh<ip>', xe hoi cA mang:
// broadcast "CAR_WHO?" -> server tra loi "HUB <ip> <port>" -> luu NVS + noi lai.
WiFiUDP disc;
bool discReady = false;

void discoverHub() {
  if (!wifiOK || hubOK) return;                 // da noi duoc hub thi thoi
  if (!discReady) { disc.begin(DISC_PORT); discReady = true; }

  // 1) Doc goi tra loi (neu co)
  int sz = disc.parsePacket();
  if (sz > 0) {
    char buf[64] = {0};
    int n = disc.read(buf, sizeof(buf) - 1);
    if (n > 0 && strncmp(buf, "HUB ", 4) == 0) {
      String ip = String(buf + 4);
      int sp = ip.indexOf(' ');
      if (sp > 0) ip = ip.substring(0, sp);
      ip.trim();
      if (ip.length()) {
        if (ip != cfgHub) {                        // hub doi IP -> luu & noi lai
          buzzerTone(2600, 60); delay(60); buzzerTone(3200, 90);   // 2 bip len giong = DA TIM THAY
          hubLog("[disc] Tim thay hub moi: " + ip + " (cu: " + cfgHub + ") -> luu & noi lai");
          cfgHub = ip;
          saveNetConfig();
          wsClient.disconnect();
          startHub();
        } else if (!hubStarted) {                  // dung IP, chi la chua khoi dong client
          buzzerTone(2600, 60); delay(60); buzzerTone(3200, 90);
          startHub();
        }
        // Neu da begin() dung IP roi -> KHONG goi lai. wsClient tu retry moi 3s.
        // (Goi begin() lap lai se cat ngang bat tay dang do -> KHONG BAO GIO noi duoc.)
      }
      return;
    }
  }

  // 2) Hoi lai moi 3s (kem 1 bip NGAN = dang tim hub)
  static unsigned long lastAsk = 0;
  if (millis() - lastAsk < 3000) return;
  lastAsk = millis();
  IPAddress bc = WiFi.localIP(); bc[3] = 255;   // broadcast trong subnet hien tai
  disc.beginPacket(bc, DISC_PORT);
  disc.print("CAR_WHO?");
  disc.endPacket();
  // bip ngan, tram = dang tim (thua dan: chi bip 3 lan dau roi moi ~15s 1 lan cho do on)
  static int askN = 0;
  askN++;
  if (askN <= 3 || askN % 5 == 0) buzzerTone(1500, 25);
}

// Bat toan bo dich vu mang khi WiFi da len. Goi 1 lan (duoc gac boi wifiOK).
void onWifiUp() {
  wifiOK = true;
#if DEBUG_MODE
  Serial.print(F(">> WiFi OK. Mo trinh duyet: http://"));
  Serial.println(WiFi.localIP());
  server.on("/", handleRoot);
  server.on("/start", handleStart);
  server.on("/stop", handleStop);
  server.on("/status", handleStatus);
  server.begin();
#endif
  beep(80);
  startHub();
  startOTA();
}

void setupWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.begin(cfgSsid.c_str(), cfgPass.c_str());
  DBG("Ket noi WiFi '%s' ...\n", cfgSsid.c_str());
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 10000) { delay(250); DBG("."); }
  DBGLN("");
  if (WiFi.status() == WL_CONNECTED) onWifiUp();
  else DBGLN(F(">> WiFi chua len (qua 10s) - loop se tu bat dich vu khi WiFi len"));
}

// ===================== Setup =====================
void setup() {
#if DEBUG_MODE
  Serial.begin(115200);
  delay(300);
#endif

  // Motor pins
  pinMode(MA_IN1, OUTPUT); pinMode(MA_IN2, OUTPUT);
  pinMode(MB_IN3, OUTPUT); pinMode(MB_IN4, OUTPUT);
  ledcSetup(MA_CH, PWM_FREQ, PWM_RES); ledcAttachPin(MA_EN, MA_CH);
  ledcSetup(MB_CH, PWM_FREQ, PWM_RES); ledcAttachPin(MB_EN, MB_CH);
  stopMotors();

  // Buzzer
  pinMode(BUZZER, OUTPUT); digitalWrite(BUZZER, LOW);

  // MUX 74HC4067 (S3 noi GND tren board -> chi 3 chan chon kenh)
  pinMode(MUX_S0, OUTPUT); pinMode(MUX_S1, OUTPUT); pinMode(MUX_S2, OUTPUT);
  analogReadResolution(12);   // 0..4095

  // Encoder pins (input-only 13/14/15/17 deu co pull-up noi)
  pinMode(ENC_L_A, INPUT_PULLUP); pinMode(ENC_L_B, INPUT_PULLUP);
  pinMode(ENC_R_A, INPUT_PULLUP); pinMode(ENC_R_B, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(ENC_L_A), isrEncL, RISING);
  attachInterrupt(digitalPinToInterrupt(ENC_R_A), isrEncR, RISING);

  // Servo
  servo.setPeriodHertz(50);
  servo.attach(SERVO_PIN, 500, 2400);
  servo.write(SERVO_HOLD);

  mpuInit();           // I2C + MPU6050 (gyro Z ho tro odometry)
  gyroCalibrate();     // do troi tinh - XE PHAI DUNG YEN luc khoi dong

  loadCalibration();   // nap calibration tu NVS (neu co)
  loadNetConfig();     // nap SSID / mat khau / IP hub tu NVS (neu co)
  setupWiFi();         // ket noi WiFi + bat web server
  startHub();          // WebSocket client toi hub (chi khi da co WiFi)
  startOTA();          // bat nap firmware qua WiFi (OTA)

  DBGLN(F("\n>> Firmware san sang (dieu phoi route tu hub)"));
#if DEBUG_MODE
  printMenu();
#endif
}

// ===================== Loop =====================
#if DEBUG_MODE
unsigned long lastPrint = 0;
#endif
void loop() {
  // Doc lenh tu Serial
#if DEBUG_MODE
  if (Serial.available()) {
    String line = Serial.readStringUntil('\n');
    handleCommand(line);
  }
#endif

