huygithcm/code_tung/esp32_car/src/main.cpp
  // WiFi co the len TRE hon timeout 10s luc boot (router cham), hoac tu noi lai sau khi rot.
  // Neu khong theo doi -> wifiOK ket false vinh vien: xe co IP, ping duoc, nhung
  // hub/OTA/web KHONG BAO GIO chay (da tung dinh loi nay).
  static unsigned long lastWifiChk = 0;
  if (!wifiOK && millis() - lastWifiChk > 2000) {
    lastWifiChk = millis();
    if (WiFi.status() == WL_CONNECTED) onWifiUp();
  }

  // Web server + WebSocket client toi hub + OTA
  if (wifiOK) {
#if DEBUG_MODE
    server.handleClient();
#endif
    wsClient.loop();
    ArduinoOTA.handle();
  }

  // Chua noi duoc hub -> tu di tim (DHCP doi IP laptop cung khong sao)
  if (wifiOK && !hubOK) discoverHub();

  // Odometry: cap nhat lien tuc
  updateOdometry();

  // Dieu phoi TUNG BUOC: chi chay khi dang co buoc (curAction!=""); xong 1 buoc thi
  // curAction="" -> xe DUNG CHO server gui buoc ke. Neu khong co route, cho phep bam
  // line thu cong (menu 'g').
  static unsigned long lastPid = 0;
  if (running && curAction.length()) {
    if (stepPhase == 0) stepExec();                                    // buoc re (blocking) chay ngay
    else if (millis() - lastPid >= 10) { lastPid = millis(); stepExec(); }  // tien PID ~10ms
  } else if (!running && lineFollow && millis() - lastPid >= 10) {
    lastPid = millis();
    lineFollowStep();
  }

  // Gui telemetry ve hub moi 200ms
  static unsigned long lastTel = 0;
  if (hubOK && millis() - lastTel >= 200) { lastTel = millis(); sendTelemetry(); }

  // Stream 8 mat do line moi 200ms
#if DEBUG_MODE
  static unsigned long lastLine = 0;
  if (streamLine && millis() - lastLine > 200) {
    lastLine = millis();
    printLine();
  }
#endif

  // In dinh ky moi 500ms (chi o ban DEBUG)
#if DEBUG_MODE
  if (millis() - lastPrint > 500) {
    lastPrint = millis();
    if (lineFollow) {
      Serial.printf("[line] err=%.2f %s | x=%.0f y=%.0f th=%.0fdeg\n",
                    lineError, lineLost ? "(MAT LINE)" : "",
                    poseX, poseY, poseTheta * 180.0f / PI);
    } else {
      static long lastL = 0, lastR = 0;
      if (encL != lastL || encR != lastR) {
        Serial.printf("[enc] L=%ld (%.1fmm)  R=%ld (%.1fmm)\n",
                      encL, pulsesToMM(encL), encR, pulsesToMM(encR));
        lastL = encL; lastR = encR;
      }
    }
  }
#endif
}

